## Plan Result (Aks_demo - DeployInfrastructure)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 1 to change, 2 to destroy.</code></pre>

* Create
  * azurerm_resource_group.disks_resource_group
  * azurerm_role_assignment.disk
  * module.kubernetes[&#34;00&#34;].azapi_resource.service_operator_credential
  * module.kubernetes[&#34;01&#34;].azapi_resource.service_operator_credential
* Update
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster.kubernetes_cluster
* Delete
  * module.kubernetes[&#34;00&#34;].azurerm_federated_identity_credential.service_operator_credential
  * module.kubernetes[&#34;01&#34;].azurerm_federated_identity_credential.service_operator_credential




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.disks_resource_group will be created
  + resource "azurerm_resource_group" "disks_resource_group" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "disks-demo-rg"
      + tags     = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/aks-cft-deploy"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }
    }

  # azurerm_role_assignment.disk will be created
  + resource "azurerm_role_assignment" "disk" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a16e4c77-50e4-467f-9a3f-6b5f809b271d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.kubernetes["00"].azapi_resource.service_operator_credential will be created
  + resource "azapi_resource" "service_operator_credential" {
      + body                      = jsonencode(
            {
              + properties = {
                  + audiences = [
                      + "api://AzureADTokenExchange",
                    ]
                  + issuer    = "https://uksouth.oic.prod-aks.azure.com/531ff96d-0ae9-462a-8d2d-bec7c0b42082/81a30382-2c18-463c-84e7-b4412f2400b4/"
                  + subject   = "system:serviceaccount:azureserviceoperator-system:azureserviceoperator-default"
                }
            }
        )
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "uksouth"
      + name                      = "cft-demo-00-aks"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-demo-mi"
      + removing_special_chars    = false
      + schema_validation_enabled = false
      + type                      = "Microsoft.ManagedIdentity/userAssignedIdentities/federatedIdentityCredentials@2022-01-31-preview"
    }

  # module.kubernetes["00"].azurerm_federated_identity_credential.service_operator_credential will be destroyed
  # (because azurerm_federated_identity_credential.service_operator_credential is not in configuration)
  - resource "azurerm_federated_identity_credential" "service_operator_credential" {
      - audience            = [
          - "api://AzureADTokenExchange",
        ] -> null
      - id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-demo-mi/federatedIdentityCredentials/cft-demo-00-aks" -> null
      - issuer              = "https://uksouth.oic.prod-aks.azure.com/531ff96d-0ae9-462a-8d2d-bec7c0b42082/81a30382-2c18-463c-84e7-b4412f2400b4/" -> null
      - name                = "cft-demo-00-aks" -> null
      - parent_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-demo-mi" -> null
      - resource_group_name = "genesis-rg" -> null
      - subject             = "system:serviceaccount:azureserviceoperator-system:azureserviceoperator-default" -> null
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster.kubernetes_cluster will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "kubernetes_cluster" {
        id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-demo-00-aks"
        name                                = "cft-demo-00-aks"
        tags                                = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (37 unchanged attributes hidden)

      - oms_agent {
          - msi_auth_for_monitoring_enabled = true -> null
          - oms_agent_identity              = [] -> null
            # (1 unchanged attribute hidden)
        }

        # (10 unchanged blocks hidden)
    }

  # module.kubernetes["01"].azapi_resource.service_operator_credential will be created
  + resource "azapi_resource" "service_operator_credential" {
      + body                      = jsonencode(
            {
              + properties = {
                  + audiences = [
                      + "api://AzureADTokenExchange",
                    ]
                  + issuer    = "https://uksouth.oic.prod-aks.azure.com/531ff96d-0ae9-462a-8d2d-bec7c0b42082/0e35564d-a84d-4dd0-8d2b-0733468cc5a1/"
                  + subject   = "system:serviceaccount:azureserviceoperator-system:azureserviceoperator-default"
                }
            }
        )
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "uksouth"
      + name                      = "cft-demo-01-aks"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-demo-mi"
      + removing_special_chars    = false
      + schema_validation_enabled = false
      + type                      = "Microsoft.ManagedIdentity/userAssignedIdentities/federatedIdentityCredentials@2022-01-31-preview"
    }

  # module.kubernetes["01"].azurerm_federated_identity_credential.service_operator_credential will be destroyed
  # (because azurerm_federated_identity_credential.service_operator_credential is not in configuration)
  - resource "azurerm_federated_identity_credential" "service_operator_credential" {
      - audience            = [
          - "api://AzureADTokenExchange",
        ] -> null
      - id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-demo-mi/federatedIdentityCredentials/cft-demo-01-aks" -> null
      - issuer              = "https://uksouth.oic.prod-aks.azure.com/531ff96d-0ae9-462a-8d2d-bec7c0b42082/0e35564d-a84d-4dd0-8d2b-0733468cc5a1/" -> null
      - name                = "cft-demo-01-aks" -> null
      - parent_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-demo-mi" -> null
      - resource_group_name = "genesis-rg" -> null
      - subject             = "system:serviceaccount:azureserviceoperator-system:azureserviceoperator-default" -> null
    }

Plan: 4 to add, 1 to change, 2 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_resource_group.disks_resource_group has been deleted
  - resource "azurerm_resource_group" "disks_resource_group" {
      - id         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/disks-demo-rg" -> null
        name       = "disks-demo-rg"
        tags       = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (2 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":698,"Program":"tfcmt","SHA1":"","Target":"Aks_demo - DeployInfrastructure","Vars":{}} -->